Antoine1434/IR_sensorXOLED/disco/bsp/u8g2_pic18/u8g2_pic18.c
#include "u8g2.h"
#include <bsplib.h>

#include <xc.h>
#define _XTAL_FREQ 64000000UL

static uint8_t buf[480];

uint8_t u8x8_byte_4wire_sw_spi_pic18(u8x8_t *u8x8, uint8_t msg, uint8_t arg_int, void *arg_ptr)
{
  
    static uint8_t *data;
    
    switch(msg){
    case U8X8_MSG_BYTE_SEND:
        data = (uint8_t *)arg_ptr;
        while(arg_int--){
            SPI_write(*data++); // appel direct
              
        }
      
    break;
      
    case U8X8_MSG_BYTE_INIT: 
        /* disable chipselect */
        LATBbits.LATB2 = 1;
        /* no wait required here */
    break;
    
    case U8X8_MSG_BYTE_SET_DC:
        LATBbits.LATB0 = arg_int;
    break;
    
    case U8X8_MSG_BYTE_START_TRANSFER:
        LATBbits.LATB2 = 0;
    break;
    
    case U8X8_MSG_BYTE_END_TRANSFER:
        LATBbits.LATB2 = 1;
    break;
    default:
        break;
    }
    return 1;
} 



uint8_t u8x8_gpio_and_delay_pic18(u8x8_t *u8x8,uint8_t msg,uint8_t arg_int,void *arg_ptr)
{
    uint16_t reset_count = 0;
    switch(msg){
        case U8X8_MSG_GPIO_RESET:
            LATAbits.LATA2 = arg_int;
            reset_count++;
            break;
        case U8X8_MSG_GPIO_DC:
            LATBbits.LATB0 = arg_int;
            break;
        case U8X8_MSG_GPIO_CS:
            LATBbits.LATB2 = arg_int;
            break;
        case U8X8_MSG_DELAY_MILLI:
            while(arg_int--){
                //__delay_ms(1);
                delay_1ms();
            }
            break;
        case U8X8_MSG_GPIO_AND_DELAY_INIT:
            ANSELA = 0;
            ANSELB = 0;
    
            TRISAbits.TRISA2 = 0;// RESET (RD2 -> RA2)
            LATAbits.LATA2 = 0; // When the pin is pulled LOW, initialization of the chip is executed.
            delay_200ms();
            LATAbits.LATA2 = 1;
            delay_200ms();
            
            TRISBbits.TRISB2 = 0;// CS (RD3 -> RB2)
            LATBbits.LATB2 = 0;
    
            TRISBbits.TRISB1 = 0; // SCK (RB1)
            TRISBbits.TRISB3 = 0; // SDI (RB3)
    
            TRISBbits.TRISB0 = 0; // D/C (RD1 -> RB0)
            LATBbits.LATB0 = 0; 

    
   
    break;

        default:
            return 0;
    }
    return 1;
}

uint8_t *my_u8g2_m_12_5_f(uint8_t *page_cnt)
{
    #ifdef U8G2_USE_DYNAMIC_ALLOC
    *page_cnt = 5;
    return 0;
    #else
  
    *page_cnt = 5;
    return buf;
    #endif
}

void my_u8g2_Setup_ssd1306_96x39_f(u8g2_t *u8g2, const u8g2_cb_t *rotation, u8x8_msg_cb byte_cb, u8x8_msg_cb gpio_and_delay_cb)
{
    uint8_t tile_buf_height;
    uint8_t *buf;
    u8g2_SetupDisplay(u8g2, u8x8_d_ssd1306_96x39, u8x8_cad_001, byte_cb, gpio_and_delay_cb);
    buf = my_u8g2_m_12_5_f(&tile_buf_height);
    u8g2_SetupBuffer(u8g2, buf, tile_buf_height, u8g2_ll_hvline_vertical_top_lsb, rotation);
}

uint8_t my_u8x8_msg_cb(u8x8_t *u8x8, uint8_t msg, uint8_t arg_int, void *arg_ptr)
{
    return u8x8_d_ssd1306_96x39(u8x8, msg, arg_int, arg_ptr);
}

uint16_t my_u8x8_char_cb(u8x8_t *u8x8, uint8_t b)
{
    return 0;   
}

uint8_t my_u8x8_cad_cb(u8x8_t *u8x8, uint8_t msg, uint8_t arg_int, void *arg_ptr)
{
  return u8x8_cad_001(u8x8, msg, arg_int, arg_ptr);
}

uint8_t my_u8x8_byte_cb(u8x8_t *u8x8, uint8_t msg, uint8_t arg_int, void *arg_ptr)
{
    return u8x8_byte_4wire_sw_spi_pic18(u8x8,  msg,  arg_int, arg_ptr);
}

uint8_t my_u8x8_GPIO_cb(u8x8_t *u8x8, uint8_t msg, uint8_t arg_int, void *arg_ptr)
{
    return u8x8_gpio_and_delay_pic18(u8x8,  msg,  arg_int, arg_ptr);
}


const uint8_t u8g2_font_6x10_tf[2000] U8G2_FONT_SECTION("u8g2_font_6x10_tf") = 
  "\277\0\2\2\3\4\3\5\4\6\12\0\376\7\376\7\0\1B\2\222\7\263 \5\0b\7!\7\71C"
  "g\250\0\42\7\233R'Y\1#\15=B\257Li\250j\250\62%\0$\13=B\67\257z\247\264"
  "#\0%\13=B/\252\356\252%\23\0&\14=B/\247\230r\225dT\1'\5\31Sg(\10"
  "\273B\67\225u\1)\10\273B'\227U\11*\12-F'\247j\250v\0+\12-F\67\243\70d"
  "F\21,\7\233>O\225\0-\6\15Ng\10.\7\233>/\255\4/\13=B\37e\224\273QF"
  "\0\60\12=B\67\247\332Nu\4\61\14=B\67\313\224QF\31\305!\62\14=Bo\345\214\242\314"
  "\31\15\1\63\14=Bgh\224\263\206:-\0\64\14=B\77\313T\246\241\63J\0\65\13=B\347"
  "F\311\314H\247\5\66\13=BW\346\214\222\251\323\2\67\14=Bgh\224\63\312\65\312\0\70\13="
  "Boe\235V\326i\1\71\14=Boe\251TF\71J\0:\12\273>/\255\14\323J\0;\11"
  "\273>/\255\14U\11<\12\274B\77\266QF\31\5=\10\35Jgh\70\4>\13\274B'\243\214"
  "\62\212m\0\77\12=Bo\345\66\312t\4@\13=Boe\271\222\225\341\2A\13=B\67\247Z"
  "\217\221u\0B\14=Bg\304*\246Y\305\241\0C\14=Boe\215\62\312(\247\5D\15=B"
  "g\304*\246\230b\212C\1E\14=B\347F\31\215\224QFCF\15=B\347F\31\215\224QF"
  "\31\1G\14=Boe\215\62\212;-\0H\11=B'\333cd;I\10\273Bg\305\256\1J"
  "\14=Bwg\224QFe\224\0K\13=B'\313T\352\24\253\34L\16=B'\243\214\62\312("
  "\243\214\206\0M\12=B'\353\265\222\266\3N\12=B'\353\251\222\334:O\11=Boe\357\264"
  "\0P\15=Bg\244\254\207\312(\243\214\0Q\12E>oe\257j\303\0R\13=Bg\244\254\207"
  "*\253\34S\13=Boe\15\67\324i\1T\16=Bg\310\214\62\312(\243\214\42\0U\10=B"
  "'\373N\13V\13=B'\333\251L\61\345\10W\12=B'\273\222Jw\0X\12=B'\353T"
  "W\265\16Y\14=B'\353Tg\224QF\21Z\12=Bgh\224\273\321\20[\10\273Bg\304\316"
  "\1\134\15=B'\243\14\63\314\60\303\214\2]\10\273Bgv\216\0^\7\35R\67\247:_\6\15"
  ">g\10`\6\22['\6a\12-Bo\303\64t\32\1b\14=B'\243\214\222\251\247R\0c"
  "\12-Boe\215rZ\0d\13=B\37e\224\314-\225\12e\12-Bo\345\61\62\134\0f\14"
  "=BWVy\304\214\62\312\0g\14=:oh\235FF:-\0h\13=B'\243\214\222\251\355"
  "\0i\10\273B/#\331\32j\13\314:\77c]K\231\24\0k\14=B'\243\214\262L\263\312\1"
  "l\7\273BG\366\32m\12-BG\265TRI\7n\10-B'\231\332\16o\11-Boe;"
  "-\0p\14=:'\231z*\225QF\0q\13=:\317\334R\251\214\62\12r\13-B'\231\32"
  "e\224\21\0s\12-Boe\270\341P\0t\15=B/\243<bF\31\305\250\0u\10-B'"
  ";\225\12v\12-B'\353T\246\34\1w\11-B'[Iu\1x\11-B'\247\272\252\3y"
  "\13=:'\233Je\244\323\2z\10-Bg\350\366\20{\13\274BWe\224\64\212\31\11|\6\71"
  "C\347\10}\14\274BG\243\230\221\312(I\0~\11\35R/\252$\23\0\240\5\0b\7\241\7\71"
  "C'\15\1\242\14=>\67\17\25SLy\304\10\243\13=BWVyg\24\225\2\244\12-B'"
  "\247\231\342\312\1\245\15E>'\353T\307!\63\312(\2\246\6\71Cg\15\247\13E>oe\64;"
  "\67J\13\250\6\213^'\5\251\14=Boe\225\246J:-\0\252\12\264FoD\245j\64\2\253"
  "\13.B\267\212)\346\230c\0\254\7\224Jg\344\0\255\6\214Ng\4\256\13=Bo\345\221\346\324"
  "i\1\257\6\15^g\10\260\6\233R\257\13\261\13\65B\67\243\70dFq\10\262\10\254NO\305\346"
  "\10\263\12\254Ng\243\244\321H\0\264\6\22[O\1\265\12\65>'\333S\251\214\0\266\16=Bo"
  "\214\64RR\61\305\24S\0\267\5\11O'\270\6\22;O\1\271\7\253N/\311j\272\12\264FO"
  "E\231\64\34\1\273\14.B'\346\230c\212)F\0\274\20N>/#\15\63\314hf\244S\34\31"
  "\6\275\20N>/#\15\63\314heT\303\214\62\32\276\16M>G\303\234a\224Y\246\64\62\12\277"
  "\12=B\67\323\31\345\326\2\300\14EB/\303\274\262\36#\353\0\301\13EB\277^Y\217\221u\0"
  "\302\14EB\67\247\270\262\36#\353\0\303\14EB/*\271\262\36#\353\0\304\13EB\257\246V\326"
  "cd\35\305\14EB\67\247\270\262\36#\353\0\306\13>Bw\244\262\71Fl\16\307\15M:oe"
  "\215\62\312(\247]\3\310\16EB/\217\215\62\32)\243\214\206\0\311\16EB\77\215\215\62\32)\243"
  "\214\206\0\312\16EB\67\216\215\62\32)\243\214\206\0\313\16EB\257\32\33e\64RF\31\15\1\314"
  "\11\303B'\247\25[\3\315\11\303B\67\245\25[\3\316\11\303B\257\32)\266\6\317\11\303B'\345"
  "\25[\3\320\15=Bg\304*\216T\246\70\24\0\321\13EB\67uO\225\344\326\1\322\13EB/"
  "\303\274\262;-\0\323\12EB\277^\331\235\26\0\324\13EB\67\247\270\262;-\0\325\12EB\67"
  "\65Wv\247\5\326\12EB\257\246Vv\247\5\327\11-B'\247\272\252\3\330\13=Bo\305+\315"
  "\231\26\0\331\12EB/\303\332;-\0\332\11EB\277\314\336i\1\333\13EB\67\247\214\263;-"
  "\0\334\12EB\257\306\331;-\0\335\14EB\277\314:\325\31e\24\1\336\16=B'\243\221\362P"
  "\31e\224\21\0\337\13=Boe\231\312*+\5\340\14EB/\303Ln\230\206N#\341\13EB"
  "\277&\67LC\247\21\342\14EB\67\247Lm\230\206N#\343\14EB\67\265\251\15\323\320i\4\344"
  "\13=B\257\246\66LC\247\21\345\14EB\67\247\234\67LC\247\21\346\13.BodT\215\231\207"
  "\0\347\13=:oe\215r\332\65\0\350\14EB/\303L\256<F\206\13\351\13EB\277&W\36"
  "#\303\5\352\14EB\67\247L\255<F\206\13\353\13=B\257\246V\36#\303\5\354\11\303B'g"
  "$[\3\355\10\303B\257\206\262\65\356\10\303B\257-[\3\357\10\273B'e\331\32\360\13=BG"
  "C\271\262\235\26\0\361\12EB\67\265q\62\265\35\362\13EB/\303L\256l\247\5\363\12EB\277"
  "&W\266\323\2\364\13EB\67\247L\255l\247\5\365\13EB\67\265\251\225\355\264\0\366\12=B\257"
  "\246V\266\323\2\367\11-F\67SCS\21\370\12-Bo\310\225\346P\0\371\13EB/\303Le"
  "\247R\1\372\12EB\277\246\262S\251\0\373\13EB\67\247\214\263S\251\0\374\12=B\257\306\331\251"
  "T\0\375\14M:\277\314\246R\31\351\264\0\376\15E:'\243\221\262=TF\31\1\377\15M:\257"
  "\306\331T*#\235\26\0\0\0\0\4\377\377\0";


